# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-eid'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'openresty/brew'    # Tap for openresty

# Binaries
brew 'awscli'     # Official Amazon AWS command-line interface
brew 'bash'       # Latest Bash version, Bourne-Again SHell, a UNIX command interpreter
brew 'bat'        # Clone of cat(1) with syntax highlighting and Git integration, "cat" on steroids
brew 'coreutils'  # Those that come with macOS are outdated
brew 'ffmpeg'     # A complete, cross-platform solution to record, convert and stream audio and video. https://ffmpeg.org/
brew 'gh'         # GitHub command-line tool
brew 'git'        #
brew 'gnupg2'     # GNU Pretty Good Privacy (PGP) package
brew 'grep'       #
brew 'httpie'     # User-friendly cURL replacement (command-line HTTP client)
brew 'hub'        # Add GitHub support to git on the command-line
brew 'mackup'     # Keep your Mac's application settings in sync
brew 'mas'        # Mac App Store manager, Mac App Store command-line interface
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20 Manage compile and link flags for libraries
brew 'stripe'     # Credit Card gateway
brew 'trash'      # Manage the Trash bin
brew 'tree'       # List directories in a tree structure
brew 'zlib'       # Needed for Memcached

# Spatie Medialibrary
brew 'jpegoptim'  # Utility to optimize JPEG files
brew 'optipng'    # PNG file optimizer
brew 'pngquant'   # PNG image optimizing utility
brew 'svgo'       # Nodejs-based tool for optimizing SVG vector graphics files
brew 'gifsicle'   # GIF image/animation creator/editor

# Development
# ~ PHP ~
# brew 'php'
# brew 'php@7.3'
# brew 'php@7.2'
# brew 'composer'

brew 'imagemagick'  # Tools and libraries to manipulate images in many formats
brew 'libmemcached' # C and C++ client library to the memcached server
brew 'memcached'    # Free & open source, high-performance, distributed memory object caching system

# brew 'mysql'
# brew 'nginx'      # HTTP(S) server and reverse proxy, and IMAP/POP3 proxy server
brew 'openresty'    # HTTP(S) server and reverse proxy, and IMAP/POP3 proxy server, logging support

brew 'node'         # JavaScript runtime built on Chrome's V8 JavaScript engine.
# brew 'redis'      # In-memory data structure store, used as a database, cache and message broker
# brew 'yarn'       # JavaScript package manager

# Apps
# PASSWORD MANAGERS
# cask '1password'
# cask '1password-cli'
cask 'lastpass'

cask 'aerial'       # Aerial is a Mac screensaver based on the new Apple TV screensaver
cask 'alfred'       # https://www.alfredapp.com/
cask 'bartender'    # Bartender 3 lets you organize your menu bar icons, by hiding them, rearranging them, show hidden items with a click or keyboard shortcut
cask 'caffeine'     # Prevent your Mac from automatically going to sleep, dimming the screen or starting screen savers
# cask 'dbngin'     # Free All-in-One Database Version Management Tool
cask 'discord'      # Discord is the easiest way to communicate over voice, video, and text
cask 'docker'       # Container Runtime Engine
# cask 'figma'      # UI Design
cask 'firefox'
cask 'github'
cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'gpg-suite'
# cask 'imageoptim'
# cask 'insomnia'             # REST API Toolkit
# cask 'java'
# cask 'mysqlworkbench'
# cask 'nvidia-geforce-now'   # NVIDIA GeForce NOW
# cask 'steam'
# cask 'phpstorm'             # JetBrains PhpStorm PHP IDE
# cask 'screenflow'           # Video editing and screen recording
cask 'davinci-resolve-1611'   # Video editing and screen recording
# cask 'skype'
cask 'slack'
cask 'sublime-text'
cask 'tableplus'              # Database management made easy
cask 'telegram-desktop'       # Telegram Desktop
cask 'there'                  # Contacts Time Zone Clock
cask 'the-unarchiver'         # The Unarchiver is the only app you need to open RAR on Mac FREE
# cask 'tinkerwell'           # Code editor that runs your code within local and remote PHP applications
cask 'tor-browser'
cask 'transmission'           # Free BitTorrent Client
# cask 'transmit'             # file transfer app, FTP, SSH WebDav, S3 etc...
cask 'vagrant'                # Need to read more
cask 'virtualbox'             # Might need to allow access in Security settings
cask 'virtualbox-extension-pack'
cask 'visual-studio-code'     # Microsoft Visual Studio Code, VS Code
cask 'vlc'
# cask 'whatsapp'
cask 'shift'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-roboto-condensed'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
mas 'Giphy Capture', id: 668208984
mas 'Spark', id: 1176895641
